In [12]:
import numpy as np
import pandas as pd

In [13]:
import pandas as pd
save_path = "/data/zyang/datasets/amazon_book_new/"
train_ = pd.read_pickle(save_path+"train_ood2.pkl")
valid_ = pd.read_pickle(save_path+"valid_ood2.pkl")
test_ = pd.read_pickle(save_path+"test_ood2.pkl")
data = pd.concat([train_,valid_,test_],axis=0)

In [14]:
valid_.shape, test_.shape

((25747, 9), (25747, 9))

In [15]:
valid_.head(2)

,uid,iid,label,timestamp,his,his_title,title,flag,not_cold
50,1,6108,1,1.512259e+09,"[0, 3054, 24657, 1798, 5404, 15904, 1344, 6688...","[, ENDURANCE: SHACKLETON'S INCREDIBLE VOYAGE b...",Summerlost,0.0,1
68,3,15867,0,1.512518e+09,[0],[],The Tempest,0.0,0

In [16]:
test_.head(2)

,uid,iid,label,timestamp,his,his_title,title,flag,not_cold
51,1,872,0,1.513987e+09,"[0, 3054, 24657, 1798, 5404, 15904, 1344, 6688...","[, ENDURANCE: SHACKLETON'S INCREDIBLE VOYAGE b...",God's Battalions: The Case for the Crusades,1.0,1
52,1,12784,0,1.514246e+09,"[0, 3054, 24657, 1798, 5404, 15904, 1344, 6688...","[, ENDURANCE: SHACKLETON'S INCREDIBLE VOYAGE b...",The Royal Treatment: A Crown Jewels Romantic C...,1.0,1

In [3]:
data.shape

(778957, 9)

In [4]:
train_.shape,valid_.shape, test_.shape

((727463, 9), (25747, 9), (25747, 9))

In [5]:
user_info = train_.groupby('uid').agg({'label':'count'})
user_info.quantile(0.1)

label    8.0
Name: 0.1, dtype: float64

In [6]:
user_info.shape

(22854, 1)

In [7]:
user_info[user_info['label']>10]

       label
uid
1         50
4         28
6         41
8         39
9         31
...      ...
22953     22
22955     16
22960     18
22962     11
22964     28

[19525 rows x 1 columns]

In [8]:
# test_[['uid','iid']].apply(lambda x: x.uid in train_user and x.iid in train_item, axis=1).astype("int")

In [9]:
item_info = train_.groupby('iid').agg({'label':'count'})
item_info.describe()

              label
count  33713.000000
mean      21.578115
std       33.510363
min        1.000000
25%        5.000000
50%       12.000000
75%       24.000000
max     1060.000000

In [10]:
item_info.quantile(0.1)

label    3.0
Name: 0.1, dtype: float64

In [11]:
test_['warm'] =

SyntaxError: invalid syntax (2252409866.py, line 1)